src_ext/InformationRegisters/УЗ_СвязиСУчетомХозяина.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_СвязиСУчетомХозяина</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъектХозяина</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Режим</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ПриходДенег</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасходДенег</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_НачисленияПедагогам</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасчетЗарплаты</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_ДокументыФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ДокументыФизЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВидаДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияНомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Enums/УЗ_ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УЗ_ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяКасса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассаУченики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийРасход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/Documents/УЗ_ПриходДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_ПриходДенег</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
				<xr:Item>Catalog.УЗ_Абонемент</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Касса</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Documents/УЗ_РасходДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_РасходДенег</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
				<xr:Item>Document.УЗ_РасчетЗарплаты</xr:Item>
				<xr:Item>Catalog.УЗ_Абонемент</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Касса</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Расходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_РасчетЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/CommonModules/УЗ_СредаМост/Ext/Module.bsl
//Мост в учёт программы (закрытие смены, docs/мост_в_учёт_хозяина.md): люди «Учёта занятий» связываются со
//справочниками программы — плательщик (мама, папа, бабушка) с контрагентом, педагог с сотрудником (Бухгалтерия, УНФ)
//или физическим лицом (Управление торговлей). Связи — в регистре УЗ_СвязиСУчетомХозяина: ссылка программы хранится
//без заимствования (тип «любой справочник, любой документ»). Ученики в учёт программы не уходят никогда (152-ФЗ).
//
//Справочники программы не заимствованы: имена берутся строкой после проверки метаданных, тексты запросов к ним
//разбираются при выполнении. Объекты программы записываются её же проверками (без режима загрузки) и правами
//пользователя: нет права добавлять контрагентов — понятная причина, а не обход.

#Область ПрограммныйИнтерфейс

//Роль связи плательщика (измерение «Роль» регистра): контрагент программы.
Функция РольПлательщик() Экспорт
	Возврат "Плательщик";
КонецФункции

//Роль связи педагога: сотрудник (Бухгалтерия, УНФ) или физическое лицо (Управление торговлей).
Функция РольПедагог() Экспорт
	Возврат "Педагог";
КонецФункции

//Что программа умеет для моста.
//Структура:
//  Семейство            — "УНФ" / "БП" / "УТ" / ...;
//  Контрагенты          — справочник контрагентов есть (имя "Контрагенты");
//  Партнеры             — в Управлении торговлей контрагент создаётся с партнёром;
//  СправочникПедагогов  — "Сотрудники" (Бухгалтерия, УНФ), "ФизическиеЛица" (Управление торговлей) или "";
//  СоздаватьПедагогов   — педагога можно создать у программы (физлицо УТ); сотрудника принимает на работу бухгалтер;
//  Зарплата             — начисление зарплаты программы оформляется (Бухгалтерия, УНФ).
Функция Возможности() Экспорт

	Семейство = УЗ_Среда.Паспорт().Семейство;
	Итог = Новый Структура("Семейство, Контрагенты, Партнеры, СправочникПедагогов, СоздаватьПедагогов, Зарплата",
		Семейство, ЕстьСправочник("Контрагенты"), ЕстьСправочник("Партнеры") И Семейство = "УТ", "", Ложь,
		Семейство = "БП" Или Семейство = "УНФ");
	Если (Семейство = "БП" Или Семейство = "УНФ") И ЕстьСправочник("Сотрудники") Тогда
		Итог.СправочникПедагогов = "Сотрудники";
	ИначеЕсли ЕстьСправочник("ФизическиеЛица") Тогда
		Итог.СправочникПедагогов = "ФизическиеЛица";
		Итог.СоздаватьПедагогов = Истина;
	КонецЕсли;
	Возврат Итог;

КонецФункции

//Плательщики документов денег за период и все педагоги — со связью с программой и кандидатом для связи.
//Организация — пустая: все. ТолькоНесвязанные — только люди без связи.
//ТаблицаЗначений: ФизЛицо, Роль, ИНН, ОбъектХозяина, Кандидат, Состояние (строка для формы).
Функция ЛюдиДляСвязи(Организация, Начало, Конец, ТолькоНесвязанные = Истина) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА Приход.Плательщик <> ЗНАЧЕНИЕ(Справочник.УЗ_ФизЛица.ПустаяСсылка)
	|			ТОГДА Приход.Плательщик
	|		ИНАЧЕ Приход.ФизЛицо
	|	КОНЕЦ КАК ФизЛицо,
	|	&РольПлательщик КАК Роль
	|ПОМЕСТИТЬ ВТЛюди
	|ИЗ
	|	Документ.УЗ_ПриходДенег КАК Приход
	|ГДЕ
	|	Приход.Проведен
	|	И Приход.Дата МЕЖДУ &Начало И &Конец
	|	И (&ВсеОрганизации ИЛИ Приход.Организация = &Организация)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Расход.Получатель <> ЗНАЧЕНИЕ(Справочник.УЗ_ФизЛица.ПустаяСсылка)
	|			ТОГДА Расход.Получатель
	|		ИНАЧЕ Расход.ФизЛицо
	|	КОНЕЦ,
	|	&РольПлательщик
	|ИЗ
	|	Документ.УЗ_РасходДенег КАК Расход
	|ГДЕ
	|	Расход.Проведен
	|	И Расход.ВидОперации = ЗНАЧЕНИЕ(Перечисление.УЗ_ВидыОпераций.КассаУченики)
	|	И Расход.Дата МЕЖДУ &Начало И &Конец
	|	И (&ВсеОрганизации ИЛИ Расход.Организация = &Организация)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ФизЛица.Ссылка,
	|	&РольПедагог
	|ИЗ
	|	Справочник.УЗ_ФизЛица КАК ФизЛица
	|ГДЕ
	|	ФизЛица.ЭтоПедагог
	|	И НЕ ФизЛица.ПометкаУдаления
	|	И НЕ ФизЛица.ЭтоГруппа
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Приход.Касса,
	|	&РольКасса
	|ИЗ
	|	Документ.УЗ_ПриходДенег КАК Приход
	|ГДЕ
	|	&СКассами
	|	И Приход.Проведен
	|	И Приход.Дата МЕЖДУ &Начало И &Конец
	|	И (&ВсеОрганизации ИЛИ Приход.Организация = &Организация)
	|	И Приход.Касса <> ЗНАЧЕНИЕ(Справочник.УЗ_Кассы.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Люди.ФизЛицо КАК ФизЛицо,
	|	Люди.Роль КАК Роль,
	|	ЕСТЬNULL(Документы.ИНН, """") КАК ИНН,
	|	Связи.ОбъектХозяина КАК ОбъектХозяина
	|ИЗ
	|	ВТЛюди КАК Люди
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УЗ_СвязиСУчетомХозяина КАК Связи
	|		ПО Люди.ФизЛицо = Связи.Объект
	|			И Люди.Роль = Связи.Роль
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УЗ_ДокументыФизЛиц КАК Документы
	|		ПО Люди.ФизЛицо = Документы.ФизЛицо
	|ГДЕ
	|	Люди.ФизЛицо <> ЗНАЧЕНИЕ(Справочник.УЗ_ФизЛица.ПустаяСсылка)
	|	И Люди.ФизЛицо <> ЗНАЧЕНИЕ(Справочник.УЗ_Кассы.ПустаяСсылка)
	|	И (НЕ &ТолькоНесвязанные
	|			ИЛИ Связи.ОбъектХозяина ЕСТЬ NULL)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Роль,
	|	Люди.ФизЛицо.Наименование";
	Запрос.УстановитьПараметр("РольПлательщик", РольПлательщик());
	Запрос.УстановитьПараметр("РольПедагог", РольПедагог());
	Запрос.УстановитьПараметр("РольКасса", РольКасса());
	Запрос.УстановитьПараметр("СКассами", ЕстьСправочник("Кассы"));
	Запрос.УстановитьПараметр("Начало", Начало);
	Запрос.УстановитьПараметр("Конец", Конец);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВсеОрганизации", Не ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("ТолькоНесвязанные", ТолькоНесвязанные);
	Люди = Запрос.Выполнить().Выгрузить();
	Люди.Колонки.Добавить("Кандидат");
	Люди.Колонки.Добавить("Состояние", Новый ОписаниеТипов("Строка"));

	Возможно = Возможности();
	Для Каждого Человек Из Люди Цикл
		Если ЗначениеЗаполнено(Человек.ОбъектХозяина) Тогда
			Человек.Состояние = НСтр("ru = 'Связан'");
			Продолжить;
		КонецЕсли;
		ИмяСправочника = ИмяСправочникаРоли(Человек.Роль, Возможно);
		Если ПустаяСтрока(ИмяСправочника) Тогда
			Человек.Состояние = НСтр("ru = 'В программе нет справочника для связи'");
			Продолжить;
		КонецЕсли;
		Поиск = НайтиКандидата(ИмяСправочника, Человек.ФизЛицо, Человек.ИНН);
		Человек.Кандидат = Поиск.Кандидат;
		Человек.Состояние = ?(Человек.Роль = РольКасса() И Поиск.Кандидат <> Неопределено,
			НСтр("ru = 'Не связана: найдена по наименованию'"), Поиск.Состояние);
	КонецЦикла;
	Возврат Люди;

КонецФункции

//Ссылка программы, связанная с человеком в роли; Неопределено — связи нет.
Функция СвязанныйОбъект(ФизЛицо, Роль) Экспорт

	Запись = РегистрыСведений.УЗ_СвязиСУчетомХозяина.СоздатьМенеджерЗаписи();
	Запись.Объект = ФизЛицо;
	Запись.Роль = Роль;
	Запись.Прочитать();
	Если Запись.Выбран() И ЗначениеЗаполнено(Запись.ОбъектХозяина) Тогда
		Возврат Запись.ОбъектХозяина;
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

//Связывает человека с элементом программы. Пустая строка — связано; иначе — почему нет.
Функция Связать(ФизЛицо, Роль, ОбъектХозяина) Экспорт

	ИмяСправочника = ИмяСправочникаРоли(Роль, Возможности());
	Если ПустаяСтрока(ИмяСправочника) Тогда
		Возврат НСтр("ru = 'В программе нет справочника для связи.'");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ОбъектХозяина)
		Или ОбъектХозяина.Метаданные() <> Метаданные.Справочники[ИмяСправочника] Тогда
		Возврат СтрШаблон(НСтр("ru = 'Выберите элемент справочника «%1».'"),
			Метаданные.Справочники[ИмяСправочника].Синоним);
	КонецЕсли;
	Запись = РегистрыСведений.УЗ_СвязиСУчетомХозяина.СоздатьМенеджерЗаписи();
	Запись.Объект = ФизЛицо;
	Запись.Роль = Роль;
	Запись.ОбъектХозяина = ОбъектХозяина;
	Запись.Дата = ТекущаяДатаСеанса();
	Запись.Автор = УЗ_Среда.ТекущийПользователь();
	Запись.Записать();
	Возврат "";

КонецФункции

//Снимает связь человека в роли.
Процедура Отвязать(ФизЛицо, Роль) Экспорт

	Набор = РегистрыСведений.УЗ_СвязиСУчетомХозяина.СоздатьНаборЗаписей();
	Набор.Отбор.Объект.Установить(ФизЛицо);
	Набор.Отбор.Роль.Установить(Роль);
	Набор.Записать();

КонецПроцедуры

//Создаёт элемент программы по человеку и связывает: плательщик — контрагент (физическое лицо; в Управлении
//торговлей с партнёром), педагог — физическое лицо Управления торговлей. Сотрудника Бухгалтерии и УНФ не создаём:
//его принимает на работу бухгалтер, у нас — только «Подобрать».
//Структура: Ссылка (созданное или Неопределено), Ошибка (строка; пустая — создано и связано).
Функция СоздатьУХозяина(ФизЛицо, Роль) Экспорт

	Итог = Новый Структура("Ссылка, Ошибка", Неопределено, "");
	Возможно = Возможности();
	ИмяСправочника = ИмяСправочникаРоли(Роль, Возможно);
	Если ПустаяСтрока(ИмяСправочника) Тогда
		Итог.Ошибка = НСтр("ru = 'В программе нет справочника для связи.'");
		Возврат Итог;
	КонецЕсли;
	Если Роль = РольКасса() Тогда
		Итог.Ошибка = НСтр("ru = 'Кассу заводит бухгалтер в программе, затем — «Выбрать в программе» здесь.'");
		Возврат Итог;
	КонецЕсли;
	Если Роль = РольПедагог() И Не Возможно.СоздаватьПедагогов Тогда
		Итог.Ошибка = СтрШаблон(НСтр("ru = 'Сотрудника принимает на работу бухгалтер в программе (справочник «%1»), "
			+ "затем — «Подобрать» здесь.'"), Метаданные.Справочники[ИмяСправочника].Синоним);
		Возврат Итог;
	КонецЕсли;
	Уже = СвязанныйОбъект(ФизЛицо, Роль);
	Если Уже <> Неопределено Тогда
		Итог.Ссылка = Уже;
		Возврат Итог;
	КонецЕсли;
	Причина = НетПраваДобавлять(ИмяСправочника);
	Если Возможно.Партнеры И Роль = РольПлательщик() И ПустаяСтрока(Причина) Тогда
		Причина = НетПраваДобавлять("Партнеры");
	КонецЕсли;
	Если Не ПустаяСтрока(Причина) Тогда
		Итог.Ошибка = Причина;
		Возврат Итог;
	КонецЕсли;

	ФИО = СокрЛП(ФизЛицо.Наименование);
	ИНН = ИННДляПрограммы(ФизЛицо);
	НачатьТранзакцию();
	Попытка
		Если Роль = РольПлательщик() Тогда
			Итог.Ссылка = НовыйКонтрагентФизЛицо(ФИО, ИНН);
		Иначе
			Итог.Ссылка = ЗаписатьНовый(ИмяСправочника, Новый Структура("Наименование, ИНН, ДатаРождения", ФИО, ИНН,
				ФизЛицо.ДатаРождения), Неопределено);
		КонецЕсли;
		Ошибка = Связать(ФизЛицо, Роль, Итог.Ссылка);
		Если Не ПустаяСтрока(Ошибка) Тогда
			ВызватьИсключение Ошибка;
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Итог.Ссылка = Неопределено;
		Итог.Ошибка = СтрШаблон(НСтр("ru = 'Не создан в программе: %1'"),
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Учёт занятий.Мост'"), УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Справочники.УЗ_ФизЛица, ФизЛицо, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	Возврат Итог;

КонецФункции

//Роль связи нашего денежного документа с документом программы (ПКО, РКО, «Поступление в кассу», «Расход из кассы»).
Функция РольДокумент() Экспорт
	Возврат "Документ";
КонецФункции

//Роль связи нашей кассы с кассой программы (УНФ, Управление торговлей; в Бухгалтерии касса — счёт 50.01).
Функция РольКасса() Экспорт
	Возврат "Касса";
КонецФункции

//Режим оформления «одним документом за день по кассе» (наличная выручка дня, общий контрагент).
Функция РежимЗаДень() Экспорт
	Возврат "ЗаДень";
КонецФункции

//Режим оформления «каждым документом» (контрагент — плательщик).
Функция РежимКаждымДокументом() Экспорт
	Возврат "КаждымДокументом";
КонецФункции

//Наши приходы денег и возвраты ученикам за период — с состоянием оформления в программе.
//Организация, Касса — пустые: все. Режим — РежимЗаДень() или РежимКаждымДокументом(): от него зависит, нужен ли
//связанный плательщик.
//ТаблицаЗначений: Документ, Вид ("Приход"/"Возврат"), Дата, Организация, Касса, Плательщик, Сумма, Безнал, Проведен,
//КонтрагентПлательщика, ОбъектХозяина, СуммаОформлено, Изменен, Ошибка, Состояние, МожноОформить.
Функция ДеньгиДляОформления(Организация, Касса, Начало, Конец, Режим) Экспорт

	Возврат ДанныеДенег(Организация, Касса, Начало, Конец, Режим, Неопределено);

КонецФункции

//Оформляет наши документы денег в программе: создаёт или переписывает ПКО/РКО («Поступление в кассу»/«Расход из
//кассы» в УНФ) и проводит их механизмом программы. Режим «за день»: приходы дня по организации и кассе — один
//документ на общего контрагента (переписывается целиком, когда в дне что-то изменилось); возвраты — каждым документом.
//Режим «каждым документом»: контрагент — связанный плательщик. Отменённый у нас документ — документ программы
//помечается на удаление. Ошибка программы (закрыт период, не заполнена статья) остаётся у строки, наш учёт не трогает.
//НашиДокументы — массив наших ссылок. Структура: Оформлено (число документов программы), Ошибки — массив
//Структура("Документ, Текст").
Функция Оформить(НашиДокументы, Режим) Экспорт

	Итог = Новый Структура("Оформлено, Ошибки", 0, Новый Массив);
	Если НашиДокументы.Количество() = 0 Тогда
		Возврат Итог;
	КонецЕсли;
	Выбранные = ДанныеДенег(Неопределено, Неопределено, '00010101', '39991231', Режим, НашиДокументы);
	Дни = Новый Соответствие;
	Для Каждого Движение Из Выбранные Цикл
		//оформлено и не изменено, безнал, плательщик не связан — делать нечего (повтор ничего не трогает)
		Если Не Движение.МожноОформить Тогда
			Если Не ЗначениеЗаполнено(Движение.ОбъектХозяина) Тогда
				Итог.Ошибки.Добавить(Новый Структура("Документ, Текст", Движение.Документ, Движение.Состояние));
			КонецЕсли;
			Продолжить;
		ИначеЕсли Режим = РежимЗаДень() И Движение.Вид = "Приход" Тогда
			Ключ = СтрШаблон("%1|%2|%3", Формат(Движение.Дата, "ДФ=yyyyMMdd"),
				XMLСтрока(Движение.Организация), XMLСтрока(Движение.Касса));
			Дни.Вставить(Ключ, Движение);
		Иначе
			ОформитьДокумент(Движение, Режим, Итог);
		КонецЕсли;
	КонецЦикла;
	Для Каждого День Из Дни Цикл
		ОформитьДень(День.Значение, Итог);
	КонецЦикла;
	Возврат Итог;

КонецФункции

//Имя справочника программы для связи в роли ("Контрагенты", "Сотрудники", "Кассы"…) или "" — связывать не с чем.
Функция СправочникДляСвязи(Роль) Экспорт
	Возврат ИмяСправочникаРоли(Роль, Возможности());
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяСправочникаРоли(Роль, Возможно)

	Если Роль = РольПлательщик() Тогда
		Возврат ?(Возможно.Контрагенты, "Контрагенты", "");
	ИначеЕсли Роль = РольПедагог() Тогда
		Возврат Возможно.СправочникПедагогов;
	ИначеЕсли Роль = РольКасса() Тогда
		Возврат ?(ЕстьСправочник("Кассы"), "Кассы", "");
	КонецЕсли;
	Возврат "";

КонецФункции

//Кандидат для связи: сначала по ИНН (один элемент), затем по наименованию (ровно один — иначе выбирать руками).
//Структура: Кандидат (ссылка или Неопределено), Состояние.
Функция НайтиКандидата(ИмяСправочника, ФизЛицо, ИНН)

	Итог = Новый Структура("Кандидат, Состояние", Неопределено, НСтр("ru = 'Не связан: в программе не найден'"));
	ПолеИНН = ПолеИННСправочника(ИмяСправочника);
	Если Не ПустаяСтрока(ИНН) И Не ПустаяСтрока(ПолеИНН) Тогда
		Найденные = ЭлементыПрограммы(ИмяСправочника, ПолеИНН, ИНН);
		Если Найденные.Количество() = 1 Тогда
			Итог.Кандидат = Найденные[0].Ссылка;
			Итог.Состояние = НСтр("ru = 'Не связан: найден по ИНН'");
			Возврат Итог;
		КонецЕсли;
	КонецЕсли;
	Найденные = ЭлементыПрограммы(ИмяСправочника, "Наименование", СокрЛП(ФизЛицо.Наименование));
	Если Найденные.Количество() = 1 Тогда
		Итог.Кандидат = Найденные[0].Ссылка;
		Итог.Состояние = НСтр("ru = 'Не связан: найден по ФИО'");
	ИначеЕсли Найденные.Количество() > 1 Тогда
		Итог.Состояние = НСтр("ru = 'Не связан: с таким ФИО несколько — выберите'");
	КонецЕсли;
	Возврат Итог;

КонецФункции

//Поле, по которому искать ИНН: у контрагентов и физлиц — ИНН, у сотрудников — ИНН их физического лица.
Функция ПолеИННСправочника(ИмяСправочника)

	Если УЗ_Общий.ЕстьРеквизит("Справочник." + ИмяСправочника, "ИНН") Тогда
		Возврат "ИНН";
	ИначеЕсли УЗ_Общий.ЕстьРеквизит("Справочник." + ИмяСправочника, "ФизическоеЛицо")
		И УЗ_Общий.ЕстьРеквизит("Справочник.ФизическиеЛица", "ИНН") Тогда
		Возврат "ФизическоеЛицо.ИНН";
	КонецЕсли;
	Возврат "";

КонецФункции

//Не более двух элементов справочника программы (не групп, без пометки удаления) с полем = значению.
Функция ЭлементыПрограммы(ИмяСправочника, Поле, Значение)

	Условия = Новый Массив;
	Условия.Добавить("Т." + Поле + " = &Значение");
	Условия.Добавить("НЕ Т.ПометкаУдаления");
	МетаданныеСправочника = Метаданные.Справочники[ИмяСправочника];
	Если МетаданныеСправочника.Иерархический
		И МетаданныеСправочника.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
		Условия.Добавить("НЕ Т.ЭтоГруппа");
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2 Т.Ссылка КАК Ссылка ИЗ Справочник.%1 КАК Т ГДЕ %2",
		ИмяСправочника, СтрСоединить(Условия, " И "));
	Запрос.УстановитьПараметр("Значение", Значение);
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

//Новый элемент справочника программы: её заполнение по умолчанию (и по данным заполнения), затем наши реквизиты —
//те, что есть у программы (перекрывают умолчания: юр. лицо по умолчанию у Бухгалтерии требует КПП); запись с её
//проверками. Ссылка или исключение.
Функция ЗаписатьНовый(ИмяСправочника, Реквизиты, ДанныеЗаполнения)

	Элемент = Справочники[ИмяСправочника].СоздатьЭлемент();
	Элемент.Заполнить(ДанныеЗаполнения);
	Для Каждого Реквизит Из Реквизиты Цикл
		Если Реквизит.Значение = Неопределено Или Не ЗначениеЗаполнено(Реквизит.Значение)
			Или Не УЗ_Общий.ЕстьРеквизит("Справочник." + ИмяСправочника, Реквизит.Ключ) Тогда
			Продолжить;
		КонецЕсли;
		Элемент[Реквизит.Ключ] = Реквизит.Значение;
	КонецЦикла;
	Если Не Элемент.ПроверитьЗаполнение() Тогда
		Тексты = Новый Массив;
		Для Каждого Сообщение Из ПолучитьСообщенияПользователю(Истина) Цикл
			Тексты.Добавить(Сообщение.Текст);
		КонецЦикла;
		ВызватьИсключение СтрШаблон(НСтр("ru = '%1: %2'"), Метаданные.Справочники[ИмяСправочника].Синоним,
			СтрСоединить(Тексты, "; "));
	КонецЕсли;
	Элемент.Записать();
	Возврат Элемент.Ссылка;

КонецФункции

//Новый контрагент программы — физическое лицо (в Управлении торговлей — с партнёром-частным лицом). Ссылка или
//исключение; вызывать в транзакции.
Функция НовыйКонтрагентФизЛицо(ФИО, ИНН)

	Партнер = Неопределено;
	Если ЕстьСправочник("Партнеры") И УЗ_Общий.ЕстьРеквизит("Справочник.Контрагенты", "Партнер") Тогда
		Партнер = ЗаписатьНовый("Партнеры", Новый Структура("Наименование, НаименованиеПолное, Клиент, "
			+ "ДатаРегистрации, ЮрФизЛицо, ГруппаДоступа", ФИО, ФИО, Истина, ТекущаяДатаСеанса(),
			ЗначениеПеречисления("КомпанияЧастноеЛицо", "ЧастноеЛицо"), ГруппаДоступаЧастногоЛица()),
			Неопределено);
	КонецЕсли;
	//УНФ определяет юр./физ. лицо по виду контрагента (по умолчанию — юрлицо, ИНН обрезается до 10)
	Реквизиты = Новый Структура("Наименование, НаименованиеПолное, ИНН, ЮридическоеФизическоеЛицо, ЮрФизЛицо, "
		+ "ВидКонтрагента", ФИО, ФИО, ИНН, ЗначениеПеречисления("ЮридическоеФизическоеЛицо", "ФизическоеЛицо"),
		ЗначениеПеречисления("ЮрФизЛицо", "ФизЛицо"),
		ЗначениеПеречисления("ВидыКонтрагентов", "ФизическоеЛицо"));
	Если Партнер <> Неопределено Тогда
		Реквизиты.Вставить("Партнер", Партнер);
	КонецЕсли;
	Возврат ЗаписатьНовый("Контрагенты", Реквизиты,
		?(Партнер = Неопределено, Неопределено, Новый Структура("Партнер", Партнер)));

КонецФункции

//Группа доступа нового партнёра Управления торговлей (обязательна, если группы доступа партнёров включены): как у
//последнего частного лица, иначе первая по наименованию; групп нет — Неопределено.
Функция ГруппаДоступаЧастногоЛица()

	Если Не ЕстьСправочник("ГруппыДоступаПартнеров")
		Или Не УЗ_Общий.ЕстьРеквизит("Справочник.Партнеры", "ГруппаДоступа") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Т.ГруппаДоступа КАК ГруппаДоступа
	|ИЗ
	|	Справочник.%1 КАК Т
	|ГДЕ
	|	Т.ЮрФизЛицо = &ЧастноеЛицо
	|	И Т.ГруппаДоступа <> ЗНАЧЕНИЕ(Справочник.%2.ПустаяСсылка)
	|	И НЕ Т.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.ДатаРегистрации УБЫВ", "Партнеры", "ГруппыДоступаПартнеров");
	Запрос.УстановитьПараметр("ЧастноеЛицо", ЗначениеПеречисления("КомпанияЧастноеЛицо", "ЧастноеЛицо"));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ГруппаДоступа;
	КонецЕсли;
	Запрос.Текст = СтрШаблон(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Т.Ссылка КАК ГруппаДоступа
	|ИЗ
	|	Справочник.%1 КАК Т
	|ГДЕ
	|	НЕ Т.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.Наименование", "ГруппыДоступаПартнеров");
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.ГруппаДоступа, Неопределено);

КонецФункции

//Значение перечисления программы или Неопределено, если такого нет.
Функция ЗначениеПеречисления(ИмяПеречисления, ИмяЗначения)

	МетаданныеПеречисления = Метаданные.Перечисления.Найти(ИмяПеречисления);
	Если МетаданныеПеречисления = Неопределено
		Или МетаданныеПеречисления.ЗначенияПеречисления.Найти(ИмяЗначения) = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Перечисления[ИмяПеречисления][ИмяЗначения];

КонецФункции

//ИНН человека, если он корректен для физического лица (12 цифр), иначе пустая строка: программа проверяет ИНН
//контрольными разрядами и не запишет элемент с неверным.
Функция ИННДляПрограммы(ФизЛицо)

	ИНН = СокрЛП(РегистрыСведений.УЗ_ДокументыФизЛиц.ДанныеФизЛица(ФизЛицо).ИНН);
	Если ПустаяСтрока(ИНН) Или Не ПустаяСтрока(РегистрыСведений.УЗ_ДокументыФизЛиц.ОшибкаИНН(ИНН)) Тогда
		Возврат "";
	КонецЕсли;
	Возврат ИНН;

КонецФункции

Функция НетПраваДобавлять(ИмяСправочника)

	Если ПравоДоступа("Добавление", Метаданные.Справочники[ИмяСправочника]) Тогда
		Возврат "";
	КонецЕсли;
	Возврат СтрШаблон(НСтр("ru = 'Нет права добавлять «%1» в программе: создайте элемент там (или попросите "
		+ "бухгалтера) и нажмите «Подобрать».'"), Метаданные.Справочники[ИмяСправочника].Синоним);

КонецФункции

Функция ЕстьСправочник(ИмяСправочника)

	Возврат Метаданные.Справочники.Найти(ИмяСправочника) <> Неопределено;

КонецФункции

//НашиДокументы — массив наших ссылок или Неопределено (все за период).
Функция ДанныеДенег(Организация, Касса, Начало, Конец, Режим, НашиДокументы)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Приход.Ссылка КАК Документ,
	|	""Приход"" КАК Вид,
	|	Приход.Дата КАК Дата,
	|	Приход.Организация КАК Организация,
	|	Приход.Касса КАК Касса,
	|	ВЫБОР
	|		КОГДА Приход.Плательщик <> ЗНАЧЕНИЕ(Справочник.УЗ_ФизЛица.ПустаяСсылка)
	|			ТОГДА Приход.Плательщик
	|		ИНАЧЕ Приход.ФизЛицо
	|	КОНЕЦ КАК Плательщик,
	|	Приход.СуммаДокумента КАК Сумма,
	|	Приход.ДокументОснования ССЫЛКА Документ.УЗ_СчетНаОплатуQR КАК Безнал,
	|	Приход.Проведен КАК Проведен,
	|	Приход.ВерсияДанных КАК ВерсияДанных
	|ПОМЕСТИТЬ ВТДеньги
	|ИЗ
	|	Документ.УЗ_ПриходДенег КАК Приход
	|ГДЕ
	|	Приход.Дата МЕЖДУ &Начало И &Конец
	|	И (&ВсеОрганизации ИЛИ Приход.Организация = &Организация)
	|	И (&ВсеКассы ИЛИ Приход.Касса = &Касса)
	|	И (&ВсеДокументы ИЛИ Приход.Ссылка В (&НашиДокументы))
	|	И Приход.ВидОперации = ЗНАЧЕНИЕ(Перечисление.УЗ_ВидыОпераций.КассаУченики)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Расход.Ссылка,
	|	""Возврат"",
	|	Расход.Дата,
	|	Расход.Организация,
	|	Расход.Касса,
	|	ВЫБОР
	|		КОГДА Расход.Получатель <> ЗНАЧЕНИЕ(Справочник.УЗ_ФизЛица.ПустаяСсылка)
	|			ТОГДА Расход.Получатель
	|		ИНАЧЕ Расход.ФизЛицо
	|	КОНЕЦ,
	|	Расход.СуммаДокумента,
	|	ЛОЖЬ,
	|	Расход.Проведен,
	|	Расход.ВерсияДанных
	|ИЗ
	|	Документ.УЗ_РасходДенег КАК Расход
	|ГДЕ
	|	Расход.Дата МЕЖДУ &Начало И &Конец
	|	И (&ВсеОрганизации ИЛИ Расход.Организация = &Организация)
	|	И (&ВсеКассы ИЛИ Расход.Касса = &Касса)
	|	И (&ВсеДокументы ИЛИ Расход.Ссылка В (&НашиДокументы))
	|	И Расход.ВидОперации = ЗНАЧЕНИЕ(Перечисление.УЗ_ВидыОпераций.КассаУченики)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Деньги.Документ КАК Документ,
	|	Деньги.Вид КАК Вид,
	|	Деньги.Дата КАК Дата,
	|	Деньги.Организация КАК Организация,
	|	Деньги.Касса КАК Касса,
	|	Деньги.Плательщик КАК Плательщик,
	|	Деньги.Сумма КАК Сумма,
	|	Деньги.Безнал КАК Безнал,
	|	Деньги.Проведен КАК Проведен,
	|	Плательщики.ОбъектХозяина КАК КонтрагентПлательщика,
	|	Связи.ОбъектХозяина КАК ОбъектХозяина,
	|	ЕСТЬNULL(Связи.Сумма, 0) КАК СуммаОформлено,
	|	ЕСТЬNULL(Связи.ВерсияДанных, """") КАК ВерсияОформления,
	|	Деньги.ВерсияДанных КАК ВерсияДанных,
	|	ЕСТЬNULL(Связи.Ошибка, """") КАК Ошибка
	|ИЗ
	|	ВТДеньги КАК Деньги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УЗ_СвязиСУчетомХозяина КАК Связи
	|		ПО Деньги.Документ = Связи.Объект
	|			И (Связи.Роль = &РольДокумент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УЗ_СвязиСУчетомХозяина КАК Плательщики
	|		ПО Деньги.Плательщик = Плательщики.Объект
	|			И (Плательщики.Роль = &РольПлательщик)
	|ГДЕ
	|	(Деньги.Проведен
	|			ИЛИ НЕ Связи.Объект ЕСТЬ NULL)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Документ";
	Запрос.УстановитьПараметр("Начало", Начало);
	Запрос.УстановитьПараметр("Конец", Конец);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВсеОрганизации", Не ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("Касса", Касса);
	Запрос.УстановитьПараметр("ВсеКассы", Не ЗначениеЗаполнено(Касса));
	Запрос.УстановитьПараметр("НашиДокументы", НашиДокументы);
	Запрос.УстановитьПараметр("ВсеДокументы", НашиДокументы = Неопределено);
	Запрос.УстановитьПараметр("РольДокумент", РольДокумент());
	Запрос.УстановитьПараметр("РольПлательщик", РольПлательщик());
	Деньги = Запрос.Выполнить().Выгрузить();
	Деньги.Колонки.Добавить("Состояние", Новый ОписаниеТипов("Строка"));
	Деньги.Колонки.Добавить("МожноОформить", Новый ОписаниеТипов("Булево"));
	Деньги.Колонки.Добавить("Изменен", Новый ОписаниеТипов("Булево"));
	Для Каждого Движение Из Деньги Цикл
		//версия документа — строка неограниченной длины: в запросе её не сравнить
		Движение.Изменен = Не ПустаяСтрока(Движение.ВерсияОформления)
			И Движение.ВерсияОформления <> Движение.ВерсияДанных;
		ЗаполнитьСостояниеДенег(Движение, Режим);
	КонецЦикла;
	Возврат Деньги;

КонецФункции

Процедура ЗаполнитьСостояниеДенег(Движение, Режим)

	Движение.МожноОформить = Истина;
	Если Движение.Безнал Тогда
		Движение.МожноОформить = Ложь;
		Движение.Состояние = НСтр("ru = 'Безналичная оплата: в программу её приносит выписка банка — только сверка'");
	ИначеЕсли Не ПустаяСтрока(Движение.Ошибка) Тогда
		Движение.Состояние = НСтр("ru = 'Не оформлено: '") + Движение.Ошибка;
	ИначеЕсли Не Движение.Проведен Тогда
		Движение.Состояние = НСтр("ru = 'Отменён в учёте занятий: документ программы будет помечен на удаление'");
	ИначеЕсли Не ЗначениеЗаполнено(Движение.ОбъектХозяина) Тогда
		Если Режим = РежимКаждымДокументом() И Не ЗначениеЗаполнено(Движение.КонтрагентПлательщика) Тогда
			Движение.МожноОформить = Ложь;
			Движение.Состояние = НСтр("ru = 'Плательщик не связан с контрагентом — свяжите на вкладке «Люди»'");
		Иначе
			Движение.Состояние = НСтр("ru = 'Не оформлено'");
		КонецЕсли;
	ИначеЕсли Движение.Изменен Тогда
		Движение.Состояние = НСтр("ru = 'Изменено после оформления — оформите ещё раз'");
	Иначе
		Движение.МожноОформить = Ложь;
		Движение.Состояние = НСтр("ru = 'Оформлено'");
	КонецЕсли;

КонецПроцедуры

//Все приходы дня по организации и кассе — один документ программы на общего контрагента.
Процедура ОформитьДень(Образец, Итог)

	Приходы = ДанныеДенег(Образец.Организация, Образец.Касса, НачалоДня(Образец.Дата), КонецДня(Образец.Дата),
		РежимЗаДень(), Неопределено);
	День = Новый Массив;
	Существующий = Неопределено;
	Сумма = 0;
	Дата = НачалоДня(Образец.Дата);
	Для Каждого Движение Из Приходы Цикл
		Если Движение.Вид <> "Приход" Или Движение.Безнал Тогда
			Продолжить;
		КонецЕсли;
		День.Добавить(Движение);
		Если ЗначениеЗаполнено(Движение.ОбъектХозяина) И Существующий = Неопределено Тогда
			Существующий = Движение.ОбъектХозяина;
		КонецЕсли;
		Если Движение.Проведен Тогда
			Сумма = Сумма + Движение.Сумма;
			Дата = Макс(Дата, Движение.Дата);
		КонецЕсли;
	КонецЦикла;

	Ошибка = "";
	Попытка
		Если Сумма = 0 Тогда
			ПометитьНаУдалениеВПрограмме(Существующий);
			Документ = Неопределено;
		Иначе
			Данные = НовыеДанныеКассовогоДокумента(Образец, "Приход", Сумма, Существующий);
			Данные.Дата = Дата;
			Данные.Контрагент = ОбщийКонтрагент();
			Данные.Человек = НСтр("ru = 'Физические лица'");
			Данные.Основание = СтрШаблон(НСтр("ru = 'Выручка учёта занятий за %1 (документов: %2)'"),
				Формат(Дата, "ДЛФ=D"), День.Количество());
			Документ = ЗаписатьКассовыйДокумент(Данные);
			Итог.Оформлено = Итог.Оформлено + 1;
		КонецЕсли;
	Исключение
		Ошибка = ТекстОшибкиПрограммы(ИнформацияОбОшибке(), Образец.Документ);
		Документ = Существующий;
		Итог.Ошибки.Добавить(Новый Структура("Документ, Текст", Образец.Документ, Ошибка));
	КонецПопытки;
	Для Каждого Движение Из День Цикл
		ЗаписатьСвязьДокумента(Движение, ?(Движение.Проведен, Документ, Неопределено), РежимЗаДень(),
			?(Движение.Проведен, Ошибка, ""));
	КонецЦикла;

КонецПроцедуры

//Один наш документ — один документ программы.
Процедура ОформитьДокумент(Движение, Режим, Итог)

	Ошибка = "";
	Документ = Движение.ОбъектХозяина;
	Попытка
		Если Не Движение.Проведен Тогда
			ПометитьНаУдалениеВПрограмме(Документ);
			Документ = Неопределено;
		Иначе
			Данные = НовыеДанныеКассовогоДокумента(Движение, Движение.Вид, Движение.Сумма, Документ);
			Если Режим = РежимЗаДень() Тогда
				Данные.Контрагент = ОбщийКонтрагент();
			ИначеЕсли ЗначениеЗаполнено(Движение.КонтрагентПлательщика) Тогда
				Данные.Контрагент = Движение.КонтрагентПлательщика;
			Иначе
				ВызватьИсключение НСтр("ru = 'Плательщик не связан с контрагентом — свяжите на вкладке «Люди».'");
			КонецЕсли;
			Документ = ЗаписатьКассовыйДокумент(Данные);
			Итог.Оформлено = Итог.Оформлено + 1;
		КонецЕсли;
	Исключение
		Ошибка = ТекстОшибкиПрограммы(ИнформацияОбОшибке(), Движение.Документ);
		Итог.Ошибки.Добавить(Новый Структура("Документ, Текст", Движение.Документ, Ошибка));
	КонецПопытки;
	ЗаписатьСвязьДокумента(Движение, Документ, Режим, Ошибка);

КонецПроцедуры

Функция НовыеДанныеКассовогоДокумента(Движение, Вид, Сумма, Существующий)

	Данные = Новый Структура("Вид, Дата, Организация, КассаПрограммы, Контрагент, Сумма, Основание, Человек, "
		+ "Существующий, НашаКасса", Вид, Движение.Дата, Движение.Организация, СвязанныйОбъект(Движение.Касса,
		РольКасса()), Неопределено, Сумма, "", "", Существующий, Движение.Касса);
	Если ЗначениеЗаполнено(Движение.Плательщик) Тогда
		Данные.Человек = СокрЛП(Движение.Плательщик.Наименование);
	КонецЕсли;
	Данные.Основание = СтрШаблон(НСтр("ru = 'Учёт занятий: %1'"), Движение.Документ);
	Возврат Данные;

КонецФункции

//Связь нашего документа с документом программы: сумма и версия на момент оформления — по ним видно «изменено после
//оформления». Документ — Неопределено и нет ошибки: связь снимается (наш документ отменён).
Процедура ЗаписатьСвязьДокумента(Движение, Документ, Режим, Ошибка)

	Если Документ = Неопределено И ПустаяСтрока(Ошибка) Тогда
		Отвязать(Движение.Документ, РольДокумент());
		Возврат;
	КонецЕсли;
	Запись = РегистрыСведений.УЗ_СвязиСУчетомХозяина.СоздатьМенеджерЗаписи();
	Запись.Объект = Движение.Документ;
	Запись.Роль = РольДокумент();
	Запись.ОбъектХозяина = Документ;
	Запись.Сумма = Движение.Сумма;
	Запись.ВерсияДанных = Движение.Документ.ВерсияДанных;
	Запись.Режим = Режим;
	Запись.Дата = ТекущаяДатаСеанса();
	Запись.Автор = УЗ_Среда.ТекущийПользователь();
	Запись.Ошибка = Ошибка;
	Запись.Записать();

КонецПроцедуры

Функция ТекстОшибкиПрограммы(Информация, Документ)

	ЗаписьЖурналаРегистрации(НСтр("ru = 'Учёт занятий.Мост'"), УровеньЖурналаРегистрации.Предупреждение,
		Документ.Метаданные(), Документ, ПодробноеПредставлениеОшибки(Информация));
	Возврат КраткоеПредставлениеОшибки(Информация);

КонецФункции

//Помечает документ программы на удаление (проведённый — с отменой проведения, механизмом программы).
Процедура ПометитьНаУдалениеВПрограмме(Документ)

	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат;
	КонецЕсли;
	Объект = Документ.ПолучитьОбъект();
	Если Объект <> Неопределено И Не Объект.ПометкаУдаления Тогда
		Объект.УстановитьПометкуУдаления(Истина);
	КонецЕсли;

КонецПроцедуры

//Общий контрагент режима «за день» — «Физические лица (учёт занятий)»: находится по наименованию или создаётся
//физическим лицом (в Управлении торговлей — с партнёром); связь хранится с ролью «ОбщийКонтрагент».
Функция ОбщийКонтрагент()

	Связь = СвязанныйОбъект(Неопределено, РольОбщийКонтрагент());
	Если Связь <> Неопределено Тогда
		Возврат Связь;
	КонецЕсли;
	Если Не ЕстьСправочник("Контрагенты") Тогда
		ВызватьИсключение НСтр("ru = 'В программе нет справочника контрагентов.'");
	КонецЕсли;
	Наименование = НСтр("ru = 'Физические лица (учёт занятий)'");
	Найденные = ЭлементыПрограммы("Контрагенты", "Наименование", Наименование);
	Если Найденные.Количество() > 0 Тогда
		Контрагент = Найденные[0].Ссылка;
	Иначе
		Причина = НетПраваДобавлять("Контрагенты");
		Если Не ПустаяСтрока(Причина) Тогда
			ВызватьИсключение Причина;
		КонецЕсли;
		Контрагент = НовыйКонтрагентФизЛицо(Наименование, "");
	КонецЕсли;
	Запись = РегистрыСведений.УЗ_СвязиСУчетомХозяина.СоздатьМенеджерЗаписи();
	Запись.Объект = Неопределено;
	Запись.Роль = РольОбщийКонтрагент();
	Запись.ОбъектХозяина = Контрагент;
	Запись.Дата = ТекущаяДатаСеанса();
	Запись.Автор = УЗ_Среда.ТекущийПользователь();
	Запись.Записать();
	Возврат Контрагент;

КонецФункции

Функция РольОбщийКонтрагент()
	Возврат "ОбщийКонтрагент";
КонецФункции

//Кассовый документ программы для нашего вида движения ("Приход" / "Возврат"): имя документа, поле и значение вида
//операции, поле «принято от» / «выдать». Неопределено — программа не знает таких документов.
Функция КассовыйДокументПрограммы(Вид)

	Приход = Вид = "Приход";
	Семейство = УЗ_Среда.Паспорт().Семейство;
	Если Семейство = "УНФ" Тогда
		Описание = Новый Структура("Имя, ПолеВида, ЗначениеВида, ПолеЧеловека",
			?(Приход, "ПоступлениеВКассу", "РасходИзКассы"), "ВидОперации",
			?(Приход, ЗначениеПеречисления("ВидыОперацийПоступлениеВКассу", "ОтПокупателя"),
				ЗначениеПеречисления("ВидыОперацийРасходИзКассы", "Покупателю")),
			?(Приход, "ПринятоОт", "Выдать"));
	ИначеЕсли Семейство = "УТ" Тогда
		Описание = Новый Структура("Имя, ПолеВида, ЗначениеВида, ПолеЧеловека",
			?(Приход, "ПриходныйКассовыйОрдер", "РасходныйКассовыйОрдер"), "ХозяйственнаяОперация",
			ЗначениеПеречисления("ХозяйственныеОперации",
				?(Приход, "ПоступлениеОплатыОтКлиента", "ВозвратОплатыКлиенту")),
			?(Приход, "ПринятоОт", "Выдать"));
	Иначе
		Описание = Новый Структура("Имя, ПолеВида, ЗначениеВида, ПолеЧеловека",
			?(Приход, "ПриходныйКассовыйОрдер", "РасходныйКассовыйОрдер"), "ВидОперации",
			?(Приход, ЗначениеПеречисления("ВидыОперацийПКО", "ОплатаПокупателя"),
				ЗначениеПеречисления("ВидыОперацийРКО", "ВозвратПокупателю")),
			?(Приход, "ПринятоОт", "Выдать"));
	КонецЕсли;
	Если Метаданные.Документы.Найти(Описание.Имя) = Неопределено Или Описание.ЗначениеВида = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Описание;

КонецФункции

//Создаёт или переписывает кассовый документ программы и проводит его её механизмом: заполнение по умолчанию (касса,
//валюта, статья, счета), наши данные, одна строка расшифровки платежа. Ссылка или исключение с причиной программы.
Функция ЗаписатьКассовыйДокумент(Данные)

	Описание = КассовыйДокументПрограммы(Данные.Вид);
	Если Описание = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'В программе нет кассовых документов для оформления.'");
	КонецЕсли;
	МетаданныеДокумента = Метаданные.Документы[Описание.Имя];
	Если ЗначениеЗаполнено(Данные.Существующий) И Данные.Существующий.Метаданные() = МетаданныеДокумента Тогда
		Объект = Данные.Существующий.ПолучитьОбъект();
		Если Объект.ПометкаУдаления Тогда
			Объект.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
	Иначе
		Объект = Документы[Описание.Имя].СоздатьДокумент();
		Объект.Дата = Данные.Дата;
		Заполнение = Новый Структура("Организация, Контрагент", Данные.Организация, Данные.Контрагент);
		Заполнение.Вставить(Описание.ПолеВида, Описание.ЗначениеВида);
		Объект.Заполнить(Заполнение);
	КонецЕсли;
	Объект.Дата = Данные.Дата;
	Объект[Описание.ПолеВида] = Описание.ЗначениеВида;
	Объект.Организация = Данные.Организация;
	Объект.Контрагент = Данные.Контрагент;
	Объект.СуммаДокумента = Данные.Сумма;
	Если ЗначениеЗаполнено(Данные.КассаПрограммы) Тогда
		УстановитьРеквизит(Объект, "Касса", Данные.КассаПрограммы);
	КонецЕсли;
	//касса не связана и программа не подставила свою по умолчанию — единственная касса организации, иначе причина
	Если УЗ_Общий.ЕстьРеквизит(МетаданныеДокумента.ПолноеИмя(), "Касса") И Не ЗначениеЗаполнено(Объект.Касса) Тогда
		Объект.Касса = ЕдинственнаяКассаПрограммы(Данные.Организация);
		Если Не ЗначениеЗаполнено(Объект.Касса) Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Не выбрана касса программы: свяжите кассу «%1» с кассой программы "
				+ "на вкладке «Люди».'"), Данные.НашаКасса);
		КонецЕсли;
	КонецЕсли;
	УстановитьРеквизит(Объект, Описание.ПолеЧеловека, Данные.Человек);
	УстановитьРеквизит(Объект, "Основание", Данные.Основание);
	//образование не облагается НДС (подп. 14 п. 2 ст. 149 НК РФ): УНФ без этого требует ставку в строке
	Если УЗ_Общий.ЕстьРеквизит(МетаданныеДокумента.ПолноеИмя(), "НалогообложениеНДС")
		И Не ЗначениеЗаполнено(Объект.НалогообложениеНДС) Тогда
		УстановитьРеквизит(Объект, "НалогообложениеНДС", ЗначениеПеречисления("ТипыНалогообложенияНДС",
			"НеОблагаетсяНДС"));
	КонецЕсли;
	//Бухгалтерия: счета расчётов (62.01, 62.02) заполнить перед записью, даже если пользователь управляет ими сам
	Объект.ДополнительныеСвойства.Вставить("ЗаполнитьСчетаУчетаПередЗаписью", Истина);
	ЗаполнитьРасшифровкуПлатежа(Объект, Данные);

	СообщенияДо = ПолучитьСообщенияПользователю(Истина);
	Попытка
		Объект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Тексты = Новый Массив;
		Для Каждого Сообщение Из ПолучитьСообщенияПользователю(Истина) Цикл
			Тексты.Добавить(Сообщение.Текст);
		КонецЦикла;
		Тексты.Добавить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение СтрШаблон("%1: %2", МетаданныеДокумента.Синоним, СтрСоединить(Тексты, "; "));
	КонецПопытки;
	Для Каждого Сообщение Из СообщенияДо Цикл
		Сообщение.Сообщить();
	КонецЦикла;
	Возврат Объект.Ссылка;

КонецФункции

//Одна строка расшифровки платежа на всю сумму: в каждой программе свои колонки — заполняем те, что есть.
Процедура ЗаполнитьРасшифровкуПлатежа(Объект, Данные)

	Если Объект.Метаданные().ТабличныеЧасти.Найти("РасшифровкаПлатежа") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Расшифровка = Объект.РасшифровкаПлатежа;
	Если Расшифровка.Количество() = 0 Тогда
		Расшифровка.Добавить();
	КонецЕсли;
	Пока Расшифровка.Количество() > 1 Цикл
		Расшифровка.Удалить(Расшифровка.Количество() - 1);
	КонецЦикла;
	Платеж = Расшифровка[0];
	Колонки = Объект.Метаданные().ТабличныеЧасти.РасшифровкаПлатежа.Реквизиты;
	Значения = Новый Структура("СуммаПлатежа, Сумма, СуммаВзаиморасчетов, СуммаРасчетов", Данные.Сумма, Данные.Сумма,
		Данные.Сумма, Данные.Сумма);
	Значения.Вставить("КурсВзаиморасчетов", 1);
	Значения.Вставить("КратностьВзаиморасчетов", 1);
	Значения.Вставить("КурсЧислительВзаиморасчетов", 1);
	Значения.Вставить("КурсЗнаменательВзаиморасчетов", 1);
	Значения.Вставить("Курс", 1);
	Значения.Вставить("Кратность", 1);
	Значения.Вставить("ПризнакАванса", Истина);
	Значения.Вставить("СпособПогашенияЗадолженности", ЗначениеПеречисления("СпособыПогашенияЗадолженности",
		"Автоматически"));
	Если Колонки.Найти("Партнер") <> Неопределено И УЗ_Общий.ЕстьРеквизит("Справочник.Контрагенты", "Партнер") Тогда
		Значения.Вставить("Партнер", Данные.Контрагент.Партнер);
	КонецЕсли;
	Если Колонки.Найти("ВалютаВзаиморасчетов") <> Неопределено
		И УЗ_Общий.ЕстьРеквизит(Объект.Метаданные().ПолноеИмя(), "Валюта") Тогда
		Значения.Вставить("ВалютаВзаиморасчетов", Объект.Валюта);
	КонецЕсли;
	Если Колонки.Найти("СтатьяДвиженияДенежныхСредств") <> Неопределено
		И Не ЗначениеЗаполнено(Платеж.СтатьяДвиженияДенежныхСредств)
		И УЗ_Общий.ЕстьРеквизит(Объект.Метаданные().ПолноеИмя(), "СтатьяДвиженияДенежныхСредств") Тогда
		Значения.Вставить("СтатьяДвиженияДенежныхСредств", Объект.СтатьяДвиженияДенежныхСредств);
	КонецЕсли;
	ИмяДоговора = ?(Колонки.Найти("ДоговорКонтрагента") <> Неопределено, "ДоговорКонтрагента",
		?(Колонки.Найти("Договор") <> Неопределено, "Договор", ""));
	Если Не ПустаяСтрока(ИмяДоговора) Тогда
		Договор = ДоговорПокупателя(Данные.Контрагент, Данные.Организация);
		Если Договор <> Неопределено Тогда
			Значения.Вставить(ИмяДоговора, Договор);
		КонецЕсли;
	КонецЕсли;
	//УНФ: возврат при расчётах по документам — против документа оплаты, по которому числится аванс
	Если Данные.Вид <> "Приход" И Колонки.Найти("Документ") <> Неопределено
		И УЗ_Общий.ЕстьРеквизит("Справочник.Контрагенты", "ВестиРасчетыПоДокументам")
		И Данные.Контрагент.ВестиРасчетыПоДокументам Тогда
		Значения.Вставить("Документ", ПоследняяОплатаКонтрагента(Данные.Контрагент, Данные.Организация, Данные.Дата));
	КонецЕсли;
	Для Каждого Значение Из Значения Цикл
		Если Значение.Значение <> Неопределено И Колонки.Найти(Значение.Ключ) <> Неопределено Тогда
			Платеж[Значение.Ключ] = Значение.Значение;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

//Договор с покупателем (Бухгалтерия, УНФ): существующий договор контрагента с организацией, иначе новый «Основной
//договор». В Управлении торговлей договоров у кассовых документов нет — Неопределено.
Функция ДоговорПокупателя(Контрагент, Организация)

	Если Не ЕстьСправочник("ДоговорыКонтрагентов") Тогда
		Возврат Неопределено;
	КонецЕсли;
	ВидДоговора = ЗначениеПеречисления("ВидыДоговоровКонтрагентов", "СПокупателем");
	Если ВидДоговора = Неопределено Тогда
		ВидДоговора = ЗначениеПеречисления("ВидыДоговоров", "СПокупателем");
	КонецЕсли;
	Если ВидДоговора = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.%1 КАК Т
	|ГДЕ
	|	Т.Владелец = &Контрагент
	|	И Т.Организация = &Организация
	|	И Т.ВидДоговора = &ВидДоговора
	|	И НЕ Т.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.Код", "ДоговорыКонтрагентов");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат ЗаписатьНовый("ДоговорыКонтрагентов", Новый Структура("Владелец, Организация, ВидДоговора, Наименование",
		Контрагент, Организация, ВидДоговора, НСтр("ru = 'Основной договор'")),
		Новый Структура("Владелец, Организация, ВидДоговора", Контрагент, Организация, ВидДоговора));

КонецФункции

//Последний проведённый приходный кассовый документ программы от контрагента не позже даты; Неопределено — нет.
Функция ПоследняяОплатаКонтрагента(Контрагент, Организация, Дата)

	Описание = КассовыйДокументПрограммы("Приход");
	Если Описание = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.%1 КАК Т
	|ГДЕ
	|	Т.Проведен
	|	И Т.Контрагент = &Контрагент
	|	И Т.Организация = &Организация
	|	И Т.Дата <= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.Дата УБЫВ", Описание.Имя);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата", Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);

КонецФункции

//Касса программы (справочник «Кассы» УНФ и Управления торговлей), если у организации она одна; иначе Неопределено.
Функция ЕдинственнаяКассаПрограммы(Организация)

	Если Не ЕстьСправочник("Кассы") Или Не УЗ_Общий.ЕстьРеквизит("Справочник.Кассы", "Владелец")
		И Не УЗ_Общий.ЕстьРеквизит("Справочник.Кассы", "Организация") Тогда
		Возврат Неопределено;
	КонецЕсли;
	ПолеОрганизации = ?(УЗ_Общий.ЕстьРеквизит("Справочник.Кассы", "Организация"), "Организация", "Владелец");
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Кассы КАК Т
	|ГДЕ
	|	Т.%1 = &Организация
	|	И НЕ Т.ПометкаУдаления", ПолеОрганизации);
	Запрос.УстановитьПараметр("Организация", Организация);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Возврат ?(Выгрузка.Количество() = 1, Выгрузка[0].Ссылка, Неопределено);

КонецФункции

//Реквизит шапки документа программы, если он у неё есть.
Процедура УстановитьРеквизит(Объект, Имя, Значение)

	Если Значение <> Неопределено И УЗ_Общий.ЕстьРеквизит(Объект.Метаданные().ПолноеИмя(), Имя) Тогда
		Объект[Имя] = Значение;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
